IDENTIFICATION DIVISION.
PROGRAM-ID. MULTI.

DATA DIVISION.
WORKING-STORAGE SECTION.
01  NUM1         PIC 9(5) VALUE ZEROS.
01  NUM2         PIC 9(5) VALUE ZEROS.
01  PRODUCT      PIC 9(10) VALUE ZEROS.

PROCEDURE DIVISION.
DISPLAY "Enter first number: ".
ACCEPT NUM1.
DISPLAY "Enter second number: ".
ACCEPT NUM2.

MULTIPLY NUM1 BY NUM2 GIVING PRODUCT.

DISPLAY "Product is: " PRODUCT.

STOP RUN.