IDENTIFICATION DIVISION.
PROGRAM-ID SUBTRACTION.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUM1 PIC 9(3).
01 NUM2 PIC 9(3).
01 NUM3 PIC 9(3).
01 RESULT PIC 9(3).

PROCEDURE DIVISION.
    DISPLAY "Enter first number: ".
    ACCEPT NUM1.
    DISPLAY "Enter second number: ".
    ACCEPT NUM2.     
    DISPLAY "Enter third number: ".
    ACCEPT NUM3.
    SUBTRACT NUM2 FROM NUM1 GIVING RESULT.
    SUBTRACT NUM3 FROM RESULT GIVING RESULT.
    DISPLAY "The result is: " RESULT.
    STOP RUN.